In [1]:
from data.data import COVID19India

In [2]:
cin = COVID19India()

In [3]:
df = cin.moh_data(save=False)

In [4]:
df.tail()

,Name of State / UT,Total Confirmed cases (Indian National),Total Confirmed cases ( Foreign National ),Cured/Discharged/Migrated,Death
22,Ladakh,13,0,0,0
23,Uttar Pradesh,36,1,11,0
24,Uttarakhand,4,1,0,0
25,West Bengal,9,0,0,1
26,Total number of confirmed cases in India,602,47,43,13

In [7]:
cin.current_update()[0]

{'confirmeddelta': '59',
 'counterforautotimeupdate': '645',
 'deceaseddelta': '2',
 'lastupdatedtime': '26/03/2020 18:16:23',
 'recovereddelta': '2',
 'statesdelta': '0'}

In [12]:
cin.last_update()

'on 26.03.2020 at 10:15 AM'

In [15]:
a, b = cin.StateWise_data()

In [18]:
a.head()

      state_ut confirmed active recovered deaths         last_updated
0        Total       716    658        45     13  26/03/2020 18:16:23
1  Maharashtra       125    122         1      2  26/03/2020 15:20:23
2       Kerala       137    131         6      0  26/03/2020 18:16:24
3    Karnataka        55     50         3      2  26/03/2020 16:48:24
4    Telangana        44     43         1      0  26/03/2020 14:25:24

In [19]:
b.head()

      state_ut  confirmed  active  recovered  deaths         last_updated
0        Total         59      58          0       1  26/03/2020 18:16:23
1  Maharashtra          3       3          0       0  26/03/2020 15:20:23
2       Kerala         19      19          0       0  26/03/2020 18:16:24
3    Karnataka          4       3          0       1  26/03/2020 16:48:24
4    Telangana          3       3          0       0  26/03/2020 14:25:24

In [20]:
c = cin.state_district_data()

In [21]:
c.head()

  State_UT        District  Confirmed  Active  Deaths  Recovered
0   Kerala        Thrissur          5       3       0          2
1   Kerala       Alappuzha          2       1       0          1
2   Kerala       Kasaragod         46      45       0          1
3   Kerala  Pathanamthitta         12      12       0          0
4   Kerala          Kannur         23      22       0          1

In [22]:
d = cin.timeseries_data()

In [23]:
d.head()

,dailyconfirmed,dailydeceased,dailyrecovered,date,totalconfirmed,totaldeceased,totalrecovered
0,1,0,0,30 January,1,0,0
1,0,0,0,31 January,1,0,0
2,0,0,0,01 February,1,0,0
3,1,0,0,02 February,2,0,0
4,1,0,0,03 February,3,0,0

In [25]:
e = cin.tests()

In [26]:
e

,totalindividualstested,totalpositivecases,totalsamplestested,updatetimestamp
0,5900,78,6500,13/3/2020 00:00
1,12235,150,13125,18/3/2020 18:00
2,12426,168,13316,19/3/2020 10:00
3,13285,182,14175,19/3/2020 18:00
4,13486,206,14376,20/3/2020 10:00
5,14514,236,15404,20/3/2020 18:00
6,14811,271,15701,21/3/2020 10:00
7,16021,315,16911,21/3/2020 18:00
8,16109,341,16999,22/3/2020 10:00
9,17237,396,18127,22/3/2020 18:00
10,17493,415,18383,23/3/2020 10:00
11,19817,471,20707,23/3/2020 20:00
12,19974,482,20864,24/3/2020 10:00
13,21804,536,22694,24/3/2020 20:00
14,22038,539,22928,25/3/2020 10:00
15,24254,581,25144,25/3/2020 20:00

In [10]:
import pandas as pd

In [11]:
from pathlib import Path

In [12]:
import pandas as pd
import numpy as np
import requests

markdown_file = open('help.md')
file_content = markdown_file.read()
md = markdown.Markdown(extensions=['tables', 'codehilite', 'fenced_code'])
pg = md.convert(file_content)